Revit 2027 API
ParameterTypeId.CurveElemLineAngle Property
 "Angle"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveElemLineAngle { get; }
Public Shared ReadOnly Property CurveElemLineAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveElemLineAngle {
	ForgeTypeId^ get ();
}
static member CurveElemLineAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace